# PROYECTO 2 - Credit Card Payment
### Limpieza de datos
María Inés Vásquez Figueroa 18250\
Diana Ximena de León Figueroa 18607\
María José Castro Lemus 181202\
Paula Camila González Ortega

In [1]:
import numpy as np
import pandas as pd
import openpyxl

In [10]:
df = pd.read_csv("UCI_Credit_Card.csv")

In [11]:
df.head()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default.payment.next.month
0,1,20000.0,2,2,1,24,2,2,-1,-1,...,0.0,0.0,0.0,0.0,689.0,0.0,0.0,0.0,0.0,1
1,2,120000.0,2,2,2,26,-1,2,0,0,...,3272.0,3455.0,3261.0,0.0,1000.0,1000.0,1000.0,0.0,2000.0,1
2,3,90000.0,2,2,2,34,0,0,0,0,...,14331.0,14948.0,15549.0,1518.0,1500.0,1000.0,1000.0,1000.0,5000.0,0
3,4,50000.0,2,2,1,37,0,0,0,0,...,28314.0,28959.0,29547.0,2000.0,2019.0,1200.0,1100.0,1069.0,1000.0,0
4,5,50000.0,1,2,1,57,-1,0,-1,0,...,20940.0,19146.0,19131.0,2000.0,36681.0,10000.0,9000.0,689.0,679.0,0

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 0 to 29999
Data columns (total 25 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   ID                          30000 non-null  int64
 1   LIMIT_BAL                   30000 non-null  float64
 2   SEX                         30000 non-null  int64
 3   EDUCATION                   30000 non-null  int64
 4   MARRIAGE                    30000 non-null  int64
 5   AGE                         30000 non-null  int64
 6   PAY_0                       30000 non-null  int64
 7   PAY_2                       30000 non-null  int64
 8   PAY_3                       30000 non-null  int64
 9   PAY_4                       30000 non-null  int64
 10  PAY_5                       30000 non-null  int64
 11  PAY_6                       30000 non-null  int64
 12  BILL_AMT1                   30000 non-null  float64
 13  BILL_AMT2                   30000 non-null  float64
 14  BILL_AMT3                   30000 non-null  float64
 15  BILL_AMT4                   30000 non-null  float64
 16  BILL_AMT5                   30000 non-null  float64
 17  BILL_AMT6                   30000 non-null  float64
 18  PAY_AMT1                    30000 non-null  float64
 19  PAY_AMT2                    30000 non-null  float64
 20  PAY_AMT3                    30000 non-null  float64
 21  PAY_AMT4                    30000 non-null  float64
 22  PAY_AMT5                    30000 non-null  float64
 23  PAY_AMT6                    30000 non-null  float64
 24  default.payment.next.month  30000 non-null  int64
dtypes: float64(13), int64(12)
memory usage: 5.7 MB

#### Cambiar valores de variables a valores estandarizados

In [24]:
df['SEX'].value_counts()

1    18112
0    11888
Name: SEX, dtype: int64

In [16]:
df['SEX'] = df['SEX'].replace(1, 0) #hombres ahora son 0
df['SEX'] = df['SEX'].replace(2, 1) #mujeres ahora son 1
df['SEX'].value_counts()

In [30]:
df['EDUCATION'].value_counts()

2    14030
1    10585
3     4917
0      345
4      123
Name: EDUCATION, dtype: int64

In [25]:
df['EDUCATION'] = df['EDUCATION'].replace(5, 0) #unir todos los desconocidos a la categoria 0
df['EDUCATION'] = df['EDUCATION'].replace(6, 0) #unir todos los desconocidos a la categoria 0
df['EDUCATION'].value_counts()

In [21]:
df['MARRIAGE'].value_counts()

2    15964
1    13659
3      323
0       54
Name: MARRIAGE, dtype: int64

In [27]:
df['MARRIAGE'] = df['MARRIAGE'].replace(0, 3) #unir todos los desconocidos a la categoria 3
df['MARRIAGE'] = df['MARRIAGE'].replace(1, 0) #casad@s ahora son 0
df['MARRIAGE'] = df['MARRIAGE'].replace(2, 1) #solter@s ahora son 1
df['MARRIAGE'] = df['MARRIAGE'].replace(3, 2) #estado civil desconocido ahora son 2
df['MARRIAGE'].value_counts()

In [33]:
df['PAY_0'].value_counts()

 0    14737
-1     5686
 1     3688
-2     2759
 2     2667
 3      322
 4       76
 5       26
 8       19
 6       11
 7        9
Name: PAY_0, dtype: int64

In [34]:
df['PAY_0'] = df['PAY_0'].replace(-1, 0) #unir pago debidamente pago a la categoria 0
df['PAY_0'] = df['PAY_0'].replace(-2, 0) #unir pago debidamente pago a la categoria 0
df['PAY_0'].value_counts()

0    23182
1     3688
2     2667
3      322
4       76
5       26
8       19
6       11
7        9
Name: PAY_0, dtype: int64

In [40]:
# repetir lo anterior con todos los meses
df['PAY_2'] = df['PAY_2'].replace(-1, 0) #unir pago debidamente pago a la categoria 0
df['PAY_2'] = df['PAY_2'].replace(-2, 0) #unir pago debidamente pago a la categoria 0
df['PAY_2'] = df['PAY_3'].replace(-1, 0) #unir pago debidamente pago a la categoria 0
df['PAY_3'] = df['PAY_3'].replace(-2, 0) #unir pago debidamente pago a la categoria 0
df['PAY_4'] = df['PAY_4'].replace(-1, 0) #unir pago debidamente pago a la categoria 0
df['PAY_4'] = df['PAY_4'].replace(-2, 0) #unir pago debidamente pago a la categoria 0
df['PAY_5'] = df['PAY_5'].replace(-1, 0) #unir pago debidamente pago a la categoria 0
df['PAY_5'] = df['PAY_5'].replace(-2, 0) #unir pago debidamente pago a la categoria 0
df['PAY_6'] = df['PAY_6'].replace(-1, 0) #unir pago debidamente pago a la categoria 0
df['PAY_6'] = df['PAY_6'].replace(-2, 0) #unir pago debidamente pago a la categoria 0

#### Cambiar al tipo de variables correctas

In [46]:
cate = ["SEX", "EDUCATION", "MARRIAGE", "PAY_0", "PAY_2", "PAY_3", "PAY_4", "PAY_5", "PAY_6", "default.payment.next.month"]
for i in cate:
    df[i] = pd.Categorical(df[i])
    
df.dtypes

ID                               int64
LIMIT_BAL                      float64
SEX                           category
EDUCATION                     category
MARRIAGE                      category
AGE                              int64
PAY_0                         category
PAY_2                         category
PAY_3                         category
PAY_4                         category
PAY_5                         category
PAY_6                         category
BILL_AMT1                      float64
BILL_AMT2                      float64
BILL_AMT3                      float64
BILL_AMT4                      float64
BILL_AMT5                      float64
BILL_AMT6                      float64
PAY_AMT1                       float64
PAY_AMT2                       float64
PAY_AMT3                       float64
PAY_AMT4                       float64
PAY_AMT5                       float64
PAY_AMT6                       float64
default.payment.next.month    category
dtype: object

#### Cambiar nombre de columnas para más facilidad de lectura y compresión

In [47]:
#Estado de reembolso de cada mes
df = df.rename(columns={'PAY_0': 'PAY_SEP', 
                        'PAY_2': 'PAY_AGO', 
                        'PAY_3': 'PAY_JUL', 
                        'PAY_4': 'PAY_JUN', 
                        'PAY_5': 'PAY_MAY', 
                        'PAY_6': 'PAY_APR'})

In [56]:
#Monto de la factura en cada mes
df = df.rename(columns={'BILL_AMT1': 'BILL_AMT_SEP', 
                        'BILL_AMT2': 'BILL_AMT_AGO', 
                        'BILL_AMT3': 'BILL_AMT_JUL', 
                        'BILL_AMT4': 'BILL_AMT_JUN', 
                        'BILL_AMT5': 'BILL_AMT_MAY', 
                        'BILL_AMT6': 'BILL_AMT_APR'})

In [57]:
#Monto del pago anterior en cada mes
df = df.rename(columns={'PAY_AMT1': 'PAY_AMT_SEP', 
                        'PAY_AMT2': 'PAY_AMT_AGO', 
                        'PAY_AMT3': 'PAY_AMT_JUL', 
                        'PAY_AMT4': 'PAY_AMT_JUN', 
                        'PAY_AMT5': 'PAY_AMT_MAY', 
                        'PAY_AMT6': 'PAY_AMT_APR'})

In [58]:
#Incumplimiento de pago al mes siguiente 
df = df.rename(columns={'default.payment.next.month': 'PAYMENT_NEXT_MONTH'})

### Almacenamiento de la data limpia y desglose de descripcion final

In [59]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 0 to 29999
Data columns (total 25 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   ID                  30000 non-null  int64
 1   LIMIT_BAL           30000 non-null  float64
 2   SEX                 30000 non-null  category
 3   EDUCATION           30000 non-null  category
 4   MARRIAGE            30000 non-null  category
 5   AGE                 30000 non-null  int64
 6   PAY_SEP             30000 non-null  category
 7   PAY_AGO             30000 non-null  category
 8   PAY_JUL             30000 non-null  category
 9   PAY_JUN             30000 non-null  category
 10  PAY_MAY             30000 non-null  category
 11  PAY_APR             30000 non-null  category
 12  BILL_AMT_SEP        30000 non-null  float64
 13  BILL_AMT_AGO        30000 non-null  float64
 14  BILL_AMT_JUL        30000 non-null  float64
 15  BILL_AMT_JUN        30000 non-null  float64
 16  BILL_AMT_MAY        30000 non-null  float64
 17  BILL_AMT_MAY        30000 non-null  float64
 18  PAY_AMT_SEP         30000 non-null  float64
 19  PAY_AMT_AGO         30000 non-null  float64
 20  PAY_AMT_JUL         30000 non-null  float64
 21  PAY_AMT_JUN         30000 non-null  float64
 22  PAY_AMT_MAY         30000 non-null  float64
 23  PAY_AMT_MAY         30000 non-null  float64
 24  PAYMENT_NEXT_MONTH  30000 non-null  category
dtypes: category(10), float64(13), int64(2)
memory usage: 3.7 MB